In [56]:
import pandas as pd

In [57]:
#Data series
#It is a one dimensional array like object that hold any datatype
#It is similar to a column in a table

data = ["A","B","C","D","E","F","G","H","I","J"]
series = pd.Series(data)
print(series)

0    A
1    B
2    C
3    D
4    E
5    F
6    G
7    H
8    I
9    J
dtype: object

In [58]:
print(type(series))

<class 'pandas.core.series.Series'>

In [59]:
#Create a series from Dictionary
dict_ser = {'a': 1, 'b':2, 'c':3, 'd':4, 'e':5,'f':6, 'g':7, 'h':8,'i':9, 'j':10}
print(dict_ser)

{'a': 1, 'b': 2, 'c': 3, 'd': 4, 'e': 5, 'f': 6, 'g': 7, 'h': 8, 'i': 9, 'j': 10}

In [60]:
print(type(dict_ser))

<class 'dict'>

In [61]:
dict_ser = {'a': 1, 'b':2, 'c':3, 'd':4, 'e':5,'f':6, 'g':7, 'h':8,'i':9, 'j':10}
ser = pd.Series(dict_ser)
print(ser)

a     1
b     2
c     3
d     4
e     5
f     6
g     7
h     8
i     9
j    10
dtype: int64

In [62]:
print(type(ser))

<class 'pandas.core.series.Series'>

In [63]:
data = [20,6,27]
index = ['J','R','A']
pd.Series(data,index=index)

J    20
R     6
A    27
dtype: int64

In [64]:
#DataFrame
dataframe = {
    'name' : ['VSCode','Git','Docker'],
    'version' : [24,2.5,3.1],
    'year': [2024,2023,2022]
}
df = pd.DataFrame(dataframe)
print(df)

     name  version  year
0  VSCode     24.0  2024
1     Git      2.5  2023
2  Docker      3.1  2022

In [65]:
type(df)

pandas.core.frame.DataFrame

In [66]:
#Covert datafram to numpy array
import numpy as np
np.array(df)

array([['VSCode', 24.0, 2024],
       ['Git', 2.5, 2023],
       ['Docker', 3.1, 2022]], dtype=object)

In [67]:
data1 = [
    {'name':'Vscode','version':24,'year':2024},
     {'name':'Pycharm','version':22,'year':2022},
     {'name':'Spyder','version':20,'year':2020},
     {'name':'Jupyter','version':18,'year':2018}
     
     
]
df1 = pd.DataFrame(data1)
print(df1)

      name  version  year
0   Vscode       24  2024
1  Pycharm       22  2022
2   Spyder       20  2020
3  Jupyter       18  2018

In [68]:
df_sales = pd.read_csv('sales_data.csv')
print(df_sales)

     Transaction ID        Date Product Category  \
0             10001  2024-01-01      Electronics
1             10002  2024-01-02  Home Appliances
2             10003  2024-01-03         Clothing
3             10004  2024-01-04            Books
4             10005  2024-01-05  Beauty Products
..              ...         ...              ...
235           10236  2024-08-23  Home Appliances
236           10237  2024-08-24         Clothing
237           10238  2024-08-25            Books
238           10239  2024-08-26  Beauty Products
239           10240  2024-08-27           Sports

                                        Product Name  Units Sold  Unit Price  \
0                                      iPhone 14 Pro           2      999.99
1                                   Dyson V11 Vacuum           1      499.99
2                                   Levi's 501 Jeans           3       69.99
3                                  The Da Vinci Code           4       15.99
4                            Neutrogena Skincare Set           1       89.99
..                                               ...         ...         ...
235  Nespresso Vertuo Next Coffee and Espresso Maker           1      159.99
236                        Nike Air Force 1 Sneakers           3       90.00
237           The Handmaid's Tale by Margaret Atwood           3       10.99
238             Sunday Riley Luna Sleeping Night Oil           1       55.00
239                       Yeti Rambler 20 oz Tumbler           2       29.99

     Total Revenue         Region Payment Method
0          1999.98  North America    Credit Card
1           499.99         Europe         PayPal
2           209.97           Asia     Debit Card
3            63.96  North America    Credit Card
4            89.99         Europe         PayPal
..             ...            ...            ...
235         159.99         Europe         PayPal
236         270.00           Asia     Debit Card
237          32.97  North America    Credit Card
238          55.00         Europe         PayPal
239          59.98           Asia    Credit Card

[240 rows x 9 columns]

In [69]:
df_sales.head()

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [70]:
df_sales.tail(3)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

In [71]:
df_sales.sample(3)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
209,10210,2024-07-28,Sports,Bose SoundLink Color Bluetooth Speaker II,1,129.00,129.00,Asia,Credit Card
25,10026,2024-01-26,Home Appliances,Panasonic NN-SN966S Microwave,1,179.99,179.99,Europe,PayPal
15,10016,2024-01-16,Books,"Salt, Fat, Acid, Heat by Samin Nosrat",3,35.99,107.97,North America,Credit Card

In [72]:
df1.head()

      name  version  year
0   Vscode       24  2024
1  Pycharm       22  2022
2   Spyder       20  2020
3  Jupyter       18  2018

In [73]:
df1['name']

0     Vscode
1    Pycharm
2     Spyder
3    Jupyter
Name: name, dtype: object

In [74]:
#series
df1['name'][0]

'Vscode'

In [75]:
type(df1['name'])

pandas.core.series.Series

In [76]:
#loc - pick the element on the basis of the row index
df1.loc[0]

name       Vscode
version        24
year         2024
Name: 0, dtype: object

In [77]:
df1.loc[2]

name       Spyder
version        20
year         2020
Name: 2, dtype: object

In [78]:
#iloc - pick the element on the basis of the column index
df1.iloc[0]

name       Vscode
version        24
year         2024
Name: 0, dtype: object

In [79]:
df1.iloc[0][2]

C:\Users\Asus-2020\AppData\Local\Temp\ipykernel_11216\1028912939.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df1.iloc[0][2]

np.int64(2024)

In [80]:
#Accessing a specific element using at
df1.at[1,'year']

np.int64(2022)

In [81]:
df1.at[0,'name']

'Vscode'

In [82]:
#Accessing a specific element using iat
df1.iat[0,1]

np.int64(24)

In [83]:
df1.iat[0,0]

'Vscode'

In [84]:
df1.iat[2,2]

np.int64(2020)

In [85]:
#data manipulation with data frames
#add new column
df1['source']=['Opensource','Paid','Free','license']
df1

      name  version  year      source
0   Vscode       24  2024  Opensource
1  Pycharm       22  2022        Paid
2   Spyder       20  2020        Free
3  Jupyter       18  2018     license

In [86]:
#Remove column - axis = 1 - it checks the column index and deletes it. by default it checks the row index (axis=0) first
df1.drop('source',axis=1)

      name  version  year
0   Vscode       24  2024
1  Pycharm       22  2022
2   Spyder       20  2020
3  Jupyter       18  2018

In [87]:
#though i dropped the 'source' column but it still remains in the dataframe
# drop is a temporary operation, inorder to make permanent you need to provide a additional param called 'inplace'
df1

      name  version  year      source
0   Vscode       24  2024  Opensource
1  Pycharm       22  2022        Paid
2   Spyder       20  2020        Free
3  Jupyter       18  2018     license

In [88]:
df1.drop('source',axis=1,inplace=True)

In [89]:
df1

      name  version  year
0   Vscode       24  2024
1  Pycharm       22  2022
2   Spyder       20  2020
3  Jupyter       18  2018

In [90]:
#add values to the specific column
df1['version']=df1['version']+1
df1

      name  version  year
0   Vscode       25  2024
1  Pycharm       23  2022
2   Spyder       21  2020
3  Jupyter       19  2018

In [91]:
df1

      name  version  year
0   Vscode       25  2024
1  Pycharm       23  2022
2   Spyder       21  2020
3  Jupyter       19  2018

In [92]:
df1.drop(3,inplace=True)
df1

      name  version  year
0   Vscode       25  2024
1  Pycharm       23  2022
2   Spyder       21  2020

In [93]:
df1.describe()

       version    year
count      3.0     3.0
mean      23.0  2022.0
std        2.0     2.0
min       21.0  2020.0
25%       22.0  2021.0
50%       23.0  2022.0
75%       24.0  2023.0
max       25.0  2024.0

In [94]:
df_sales.describe()

       Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000